<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Brandock der Magier</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<link href="readme/bgreadme.css" type="text/css" rel="stylesheet" />
</head>
<body>

<table border="0" width="100%" cellpadding="0" cellspacing="0" align="center">
<tr>
	<td align="center"><a href="https://www.baldurs-gate.de/index.php"><img src="readme/BannerSword.png" border="0" alt="Baldur's Gate Forum" /></a></td>
	<td align="right">
		&nbsp;
	</td>
</tr>

</table>
<h1>Brandock der Magier NPC f&uuml;r BGT, BG:EE(SoD), BGII:EE und EET</h1>
<div class="section"> 
  <p><strong><a href="https://www.baldurs-gate.de/index.php">Eine Kerzenburgforum-Modifikation</a><br />  </strong>
    Text und Coding: jastey<br />
	Portraits: Acifer<br />
	Deutsches Soundset: Reader of the Runes<br />
    <strong> Sprachen:</strong> Englisch, Deutsch<br />
    <strong>Betriebssysteme: </strong>Windows, OSX, Linux</p> 
  <p>Brandock der Magier ist eine NSC Mod f&uuml;r das ganze Baldur's Gate Epos. Direkt kompatibel mit BG:EE, SoD, BGII, BGT, BGII:EE, EET. Nicht mit Tutu.</p>
    <img src="readme/brandL.png">
</div>


<h2>Inhalt</h2>
<div class="section">
  <ol>
    <li><a href="#install">Installation</a></li>
      <ul> 
		<li><a href="#eegames">Hinweise zum Modden der EE-Spiele</a> </li>
        <li><a href="#windows">Windows</a> </li>
		<li><a href="#osx">Mac OS X</a> </li>
		<li><a href="#linux">Linux</a> </li>
      </ul> 
    <li><a href="#compat">Kompatiblit&auml;t mit anderen Mods und Installationsreihenfolge</a></li>
    <li><a href="#content">Modinhalte</a>
      <ul> 
		<li><a href="#generalcontent">Generelles</a> </li>
        <li><a href="#where">Wo man Brandock trifft</a> </li>
		<li><a href="#content">Beschreibung</a> </li>
		<li><a href="#stats">Brandocks Eigenschaften und Portrait</a> </li>
		<li><a href="#spoiler">Walkthrough / Spoilers</a> </li>
		<li><a href="#7th">7.Gruppenmitglied</a> </li>
      </ul> 
    </li> 
    <li><a href="#issues">Bekannte Probleme</a></li> 
    <li><a href="#acknow">Danksagungen</a></li> 	
    <li><a href="#tools">Verwendete Tools</a>
      <ul> 
		<li><a href="#communities">Modding Communitys, Tutorials und technische Unterst&uuml;tzung</a> </li>
        <li><a href="#links">Weitere Links</a> </li>
      </ul> 
    </li> 	
    <li><a href="#credit">Copyright</a></li>
    <li><a href="#version">Versionshistorie</a> </li> 
  </ol> 
</div> 

<h1><a name="install" id="install">Installation</a></h1>
<div class="section">

HINWEIS: Wenn Ihr eine vorherige Version der Mod installiert habt, muss diese erst vollst&auml;ndig entfernt werden. Daf&uuml;r wird diese fr&uuml;here Version vollst&auml;ndig deinstalliert und alle Ressourcen (Modordner, Installationsprogramm) aus dem Spielordner entfernt. 
<br />
Das Spiel darf w&auml;hrend der Installation nicht bereits laufen.<br />
Bei Installation oder Uninstallation darf das Installationsfenster NICHT &uuml;ber Dr&uuml;cken des "X"-Kn&ouml;pfchens beendet werden. Das Schlie&szlig;en des Installationsfensters erfolgt &uuml;ber das Dr&uuml;cken der ENTER-Taste, wenn dazu die Aufforderung erscheint.<br />

<h2> <a name="eegames" id="quest">Hinweise zum Modden der EE-Spiele</a></h2>
Wenn Ihr SoD von GOG oder Steam verwendet, m&uuml;sst Ihr das Spiel erst vorbereiten, bevor Ihr Mods installieren k&ouml;nnt. Hierf&uuml;r gibt es  
<a href="https://forums.beamdog.com/discussion/71305/mod-dlc-merger-merge-steam-gog-sod-dlc-or-custom-dlcs-with-the-main-game">argent77's DLC Merger</a> oder das &auml;ltere Tool 
<a href="https://forums.beamdog.com/discussion/50441/modmerge-merge-your-steam-gog-zip-based-dlc-into-something-weidu-nearinfinity-dltcep-can-use/p1">Modmerge</a>.<br />
Bei den Spielen der Enhanced Edition ist es wichtig, dass die Mod in die richtige Spiel-Sprachversion installiert wird (damit ist die Sprache gemeint, in der Ihr das Spiel spielen wollt, diese ist nicht von der Sprache, in der Ihr die Mod installieren wollt, abh&auml;ngig). Ansonsten seht Ihr nicht die Modtexte im Spiel, sondern Fehlermeldungen. Die Spiel-Sprache, die gemoddet wird, ist in der Datei weidu.conf in Eurem Spielordner vermerkt. Wenn Ihr die Spiel-Sprache, die gemoddet werden soll, &auml;ndern wollt, dann deinstalliert alle Mods und l&ouml;scht die Datei weidu.conf. Bei der Installation der n&auml;chsten (ersten) Mod wird die zu verwendende Spiel-Sprache dann wieder abgefragt.
<br />
Die EE-Spiele sind aktiv supportete Spiele, f&uuml;r die es ab und zu Patchupdates gibt. Bitte bedenkt, dass jedes Spielupdate Eure Spieldaten wieder bereinigt! Wenn Ihr gerade ein gemoddetes Spiel spielt, dann k&ouml;nnt Ihr nach einem Spielpatch Eure Savegames nicht mehr verwenden. Eine M&ouml;glichkeit, dies zu verhindern ist es, den gesamten Spieleordner vor dem Modden in ein anderes Verzeichnis zu kopieren. Dieses Spiel kann dann unabh&auml;ngig gemoddet und &uuml;ber die BGMain.exe direkt gestartet werden.
<h2> <a name="windows" id="quest">Windows</a></h2>
Entpackt den Ordner "c#brandock" und die "setup-c#brandock.exe" in Euer Spielverzeichnis (BG:EE/SOD/BG2/BGT/BGII:EE/EET, enth&auml;lt die CHITIN.KEY Datei). Bei erfolgreichem Entpacken solltet Ihr einen Ordner "c#brandock" und eine ausf&uuml;hrbare Datei "setup-c#brandock.exe" in Eurem Spielordner vorfinden. Lasst die "setup-c#brandock.exe" &uuml;ber Doppelklick laufen. W&auml;hlt Eure Sprache und best&auml;tigt die Installation. Es sollten nun alle ben&ouml;tigten Dateien kopiert und die Installation durchgef&uuml;hrt werden. Das Installationsfenster durch das Dr&uuml;cken der ENTER-Taste schlie&szlig;en, wenn die Aufforderung dazu erscheint.<br />
&Uuml;ber erneutes Laufenlassen der setup-c#brandock.exe in Eurem Spielordner kann die Mod auch deinstalliert oder die Portraitauswahl ver&auml;ndert werden.<br />
<h2> <a name="osx" id="quest">Mac OS X</a></h2>
Entpackt den Inhalt des Modpakets und kopiert den Inhalt in Euer Spieleordner (BG:EE/SOD/BG2/BGT/BGII:EE/EET, enth&auml;lt die CHITIN.KEY Datei). Korrekt extrahiert, sollten sich in Eurem Spiel-Hauptverzeichnis ein Ordner "c#brandock" und die Dateien setup-c#brandock und setup-c#brandock.command befinden. Zum Installieren einfach die setup-c#brandock.command doppelklicken und den Instruktionen folgen. Das Installationsfenster durch das Dr&uuml;cken der ENTER-Taste schlie&szlig;en, wenn die Aufforderung dazu erscheint.<br />
&Uuml;ber erneutes Laufenlassen der setup-c#brandock.command in Eurem Spielordner kann die Mod auch deinstalliert oder die Portraitauswahl ver&auml;ndert werden.<br />
<h2> <a name="linux" id="quest">Linux</a></h2>
Entpackt den Inhalt des Modpakets und kopiert den Inhalt in Euer Spieleordner (BG:EE/SOD/BG2/BGT/BGII:EE/EET, enth&auml;lt die CHITIN.KEY Datei). Ladet die neueste Version von WeiDU f&uuml;r Linux von https://github.com/WeiDUorg/weidu/releases und kopiert WeiDU und WeInstall nach /usr/bin. &Ouml;ffnet nun ein Terminal, cd zu Eurem BG Installationsordner, und lasst 'tolower' laufen, mit der Antwort Y auf beide Nachfragen. Die zweite Option (linux.ini) k&ouml;nnt Ihr auslassen, wenn Ihr dies bereits einmal in Eurem Verzeichnis ausgef&uuml;hrt habt. Falls Ihr Euch nicht sicher seid, ist das Ausf&uuml;hren von tolower mit beiden Optionen der sichere Weg.<br />
Lasst WeInstall c#brandock in Eurem Spielordner laufen, um die Modifikation zu installieren. F&uuml;hrt wine BGMain.exe aus, um das Spiel zu starten.<br />

</div>

<h1><a name="compat" id="compat">Kompatiblit&auml;t mit anderen Mods und Installationsreihenfolge</a></h1>
<div class="section">
Brandock der Magier wurde mit WeiDU und mit dem Anspruch gr&ouml;&szlig;tm&ouml;glicher Kompatibilit&auml;t mit anderen Mods erstellt.<br />
Die Mod ist mit Imoen 4 Ever kompatibel.<br />
Die Mod ist mit Endless BG1 kompatibel.<br />
Da es sich um eine NPC Mod handelt, sollte sie nach Questmods und vor Tweakmods installiert werden. Die Mod enth&auml;lt Crossmod-Inhalte, f&uuml;r die die vorgeschlagene Installationsreihenfolge eingehalten werden sollte.<br />
F&uuml;r die Crossmod-Inhalte wird folgende Modreihenfolge empfohlen (Achtung, die aufgelisteten Mods stehen nicht unbedingt in der empfohlenenen Installationsreihenfolge):<br />
Brandock Mod installieren NACH den folgenden Mods: BGQE, The Calling, BG1NPC, Brages Redemption, Gavin BG1, Alternativen, NPC Strongholds<br /> 
Brandock Mod installieren BEVOR den folgenden Mods: Grey der Hund.<br />
</div>

<h1><a name="content" id="content">Modinhalte</a></h1>
<div class="section">
<h2> <a name="generalcontent" id="generalcontent">Generelles</a></h2>
Hinweis: Bisher enth&auml;lt die Mod offiziell nur Inhalte f&uuml;r BG1. Brandock sollte aber auch in SoD voll funktionsf&auml;hig sein und auf die meisten Spielereignisse reagieren, allerdings nur auf Englisch. Ebenfalls nur auf Englisch sind die bisherigen BGII.Inhalte: Brandock kann aufgenommen werden, hat einen Epilog und reagiert auf den Sph&auml;renquest und die Magierstronghold.<br /> 
Brandock ist ein Magier NPC f&uuml;r Baldur's Gate. In BG1 kann Brandock im Norden der K&uuml;stenstra&szlig;e getroffen werden, wo er nach Hilfe sucht, um einen Oger zu bek&auml;mpfen, der vor einer H&ouml;hle kampiert, in der sich Brandocks verlorene Besitzt&uuml;mer befinden. Wenn er in der Gruppe ist, wenn Melicamp das Huhn zur&uuml;ck zu Thalantyr gebracht wird, kann es zu einem Zwischenfall kommen, der Brandock aus der Gruppe entfernt, bis Melicamp zur&uuml;ckverwandelt wurde.<br />
Brandock interessiert sich f&uuml;r das Wissen in magischen B&uuml;chern und erh&auml;lt einen Bonus auf Sagenkunde, wenn er sie studieren darf. Er ist freundlich und hilfreich, aber bis er sich &ouml;ffnet und erz&auml;hlt, wo er herkommt und warum er an der Schwertk&uuml;ste unterwegs ist dauert ein bisschen, aus Gr&uuml;nden, die er dann mehr als bereitwillig erkl&auml;rt.<br />
Die Mod besteht aus einer Hauptkomponente und einer optionalen Komponente mit einer Auswahl von 3 alternativen Portraits f&uuml;r Brandock. Die Portraits sind weiter unten abgebildet.<br />

<h2> <a name="where" id="where">Wo man Brandock trifft</a></h2>
Brandock in BG1 wartet im Norden der K&uuml;stenstra&szlig;e. Er braucht Hilfe, um einen Oger zu bek&auml;mpfen, der vor einer H&ouml;hle kampiert. In der H&ouml;hle vermutet Brandock seine Besitzt&uuml;mer, die ihm in der Nacht zuvor gestohlen wurden. Der Oger ist derselbe, der auch Unsheys G&uuml;rtel hat und kann auch ohne Brandock in der Gruppe get&ouml;tet werden. Brandock wird dies aber erst honorieren, wenn er sich selbst in der Gruppe befindet.<br />
In SoD wartet Brandock vor dem Herzogspalast in der Menschenmenge.<br />
In BGII kann er in einem kleinen Haus gefunden werden, dass sich im Nordwesten gleich neben der Sph&auml;re befindet.<br />

<h2> <a name="content" id="content">Beschreibung</a></h2>
Brandock hat Freundschaftsdialoge, eigene Quests, Banter mit einigen NPCs und Spieler-initiierte Dialoge (PID). Die PID bieten eine M&ouml;glichkeit, Brandock &uuml;ber viele Dinge auszufragen, die sich auf Spielevents beziehen oder vorher in Dialogen angesprochen wurden. Beim Reisen mit Brandock erf&auml;hrt der HC, warum sich Brandock an der Schwertk&uuml;ste befindet und wo er herkommt - beide Orte sind eng mit der Geschichte von Baldurs Tor 1+2 verkn&uuml;pft, sollen aber hier nicht gespoilert werden. Brandock redet viel. Mehrere Themen der Spielstory und seiner Quests werden ihn mental sehr besch&auml;ftigen und dar&uuml;ber wird er entsprechend das Gespr&auml;ch mit dem HC suchen.<br />
<br />
Brandock ist sehr an magischem Wissen in Form von B&uuml;chern interessiert. In jeder Bibliothek und B&uuml;chersammlung, die man im Spiel so findet, wird er darum bitten, sich diese ansehen zu d&uuml;rfen. Wird ihm dies vom HC erluabt, dann erh&auml;lt er einen Bonus auf Sagenkunde.<br />

<h2> <a name="stats" id="stats">Brandocks Eigenschaften und Portrait</a></h2>
Wenn man Brandock in BG1 trifft, ist er ein Magier der Stufe 2 mit den Zaubern "R&uuml;stung", "Brennende H&auml;nde", "Person Bezaubern", "Schutz vor Versteinerung", "Identifizieren", "Magisches Geschoss", "Chromatische Kugel", "Furcht Bannen", "Spiegelbild" und "Schlaf" im Zauberbuch.<br />
Bei einem neuen SoD- oder BGII-Spiel erhält er entsprechend mehr Erfahrungspunkte und hat mehr Zauber im Zauberbuch. Auch seine Ausrüstung (Mantel, Kampfstab, Schleuder) ist beim Starten in SoD oder BGII entsprechend mächtiger.<br />
 Sollte der HC mehr XP haben als Brandock, dann werden Brandocks Erfahrungspunkte beim Beitreten zur Gruppe hochgelevelt. Aufgrund der 7. Gruppenmitglieds-M&ouml;glichkeit erfolgt dies jedes mal, wenn Brandock der Gruppe beitritt.<br /><br />
Brandocks Gesinnung ist Chaotisch Gut.<br /><br />
Er hat folgende Eigenschaften:
      <ul> 
		<li>STR: 15</li>
		<li>DEX: 13</li>
		<li>CON: 13</li>
		<li>INT: 18</li>
		<li>WIS: 12</li>
		<li>CHA: 13</li>
      </ul> <br />
Aus storytechnischen Gr&uuml;nden startet Brandock mit einem erh&ouml;hten Basiswert an Sagenkunde von 10.<br />
In der deutschen Version wurde f&uuml;r Brandock das Soundset von Reader of the Runes gesprochen.<br /><br />
Brandocks Portraits wurden von Acifer angefertigt. Es gibt vier Portraits, aus denen in der zweiten, optionalen Komponente gew&auml;hlt werden kann, wobei das Standardportrait in der Hauptkomponente bereits enthalten ist:<br /><br />
<img src="readme/brandL.png">
<img src="readme/brandA1.png">
<img src="readme/brandA2.png">
<img src="readme/brandA3.png"><br />
Unsicher (Standardportrait) ----- Freundlich (Alternative 1) ----- Verwegen (Alternative 2) ----- Jugendlich (Alternative 3)
<h2> <a name="spoiler" id="spoiler">Walkthrough / Spoilers</a></h2>	
Brandocks Besitzt&uuml;mer zu finden startet einen Dialogzyklus, nach dem sein pers&ouml;nlicher Quest beginnt. Seine Besitzt&uuml;mer so fr&uuml;h wie m&ouml;glich mit ihm zu holen stellt sicher, dass dies abgeschlossen ist, bevor die Gruppe von Herzog Eltan nach Kerzenburg geschickt wird. Es ist f&uuml;r die Mod nicht n&ouml;tig, aber so seht Ihr den meisten Inhalt.<br /> 
Auch taut Brandock nach dem Finden seiner Sachen merklich auf, weil der HC hierdurch seine Pl&auml;ne f&uuml;r seinen Aufenthalt an der Schwertk&uuml;ste erf&auml;hrt, was viel Gespr&auml;chsstoff bietet.<br />
<br />
Wenn man Melicamp das H&uuml;hnchen mit Brandock in der Gruppe zu Thalantyr gebracht wird, m&ouml;chte Brandock ihm helfen. Der HC kann dies verbieten. L&auml;sst er Brandock gew&auml;hren, dann wird Brandock aus der Gruppe entfernt, bis Melicamp von Thalantyr zur&uuml;ckverwandelt wurde. Dieses Event ist zum Spielen der Mod nicht n&ouml;tig, aber f&uuml;r Brandocks pers&ouml;nliche Entwicklung interessant.<br />

<h2> <a name="7th" id="7th">7. Gruppenmitglied</a></h2>
Wenn Ihr einen Gruppenslot f&uuml;r einen anderen NPC ben&ouml;tigt, dann kann Brandock auch als sogenanntes "7. Gruppenmitglied" folgen. Hierf&uuml;r muss er normal aus der Gruppe geworfen werden. Wenn er dann fragt, was Ihr von ihm wollt, dann sagt ihm, dass er weiter hinten folgen soll. Vom Scripting her erh&auml;lt er dann einen &auml;hnlichenn Status wie ein Familiar, das hei&szlig;t er folgt dem HC bei Gebietswechseln &uuml;berall hin, leider auch in Traumsequenzen oder andere Cutscenes. Als 7. Gruppenmitglied kann Brandock Befehle gegeben werden und es kann auf seine Quickslots und Zauber zugegriffen werden. Er muss normal in die Gruppe aufgenommen werden, um hochzuleveln oder um seine Items und Zauberslotbelegungen zu managen. Alle seine Dialoge, Banter und Einmischdialoge werden normal getriggert.<br />
Um ihn wieder normal in die Gruppe aufzunehmen, sprecht ihn an und w&auml;hlt in den PID-Optionen, dass Ihr Zugang zu seinem Inventar braucht. Dann wird Brandock der Gruppe wieder als normales Mitglied beitreten. Wenn dies durch Dr&uuml;cken der Pausetaste entsprechend zeitlich optimiert wird, dann kann das Management seines Inventars und sein Aufsteigen so erledigt werden, dass ein anderer NPC daf&uuml;r nicht permanent aus der Gruppe entlassen werden muss, sondern dieser wieder in die Gruppe aufgenommen werden kann, wenn er seinen "Kickout"-Dialog startet.<br />
W&auml;hrend Brandock als 7. Gruppenmitglied folgt, kann er nicht sterben, sondern verbleibt bei 1LP. Fallen seine LP in einem Kampf auf 1 LP dann f&auml;llt er in Ohnmacht und wird "neutral" (blauer Kreis), so dass Feinde ihn nicht weiter als Angriffsziel wahrnehmen. Ihn in diesem Zustand zu heilen &auml;ndert nichts daran, dass er au&szlig;er Gefecht gesetzt ist. Erst nach dem Kampf steht Brandock wieder auf. Aus technischen Gr&uuml;nden wird er vollst&auml;ndig geheilt, bevor er wieder in den 7. Gruppenmitglieds-Modus wechselt. Dies hat mit der Spielengine zu tun und wie sie die LP der Gruppenmitglieder berechnet (Brandock k&ouml;nnte sonst unter Umst&auml;nden an diesem Punkt sterben, wenn die HP zu niedrig sind, obwohl er eigentlich nicht tot war).<br />
Das Ohn&auml;chtigwerden im Kampf kann verhindert werden, indem Brandock rechtzeitig geheilt wird. &Uuml;ber PID kann ihm gesagt werden, dass er warnen soll, bevor er diesen Punkt erreicht, dann wird das Spiel pausiert wenn Brandock droht, zu wenig LP zu haben. Dies scheint in BGT aber nicht zu funktionieren.<br />
<br />
HINWEIS F&Uuml;R SPIELER:<br />
Leider ben&ouml;tigt der "7. Gruppenmitglieds-Modus" im Spiel ein besonderes Handling, um alle Einschr&auml;nkungen zu ber&uuml;cksichtigen: 
(Die Hinweise sind eine Mischung aus den vorhandenen Enginerestriktionen und den von mir verwendeten Workarounds.)<br />
-Der NPC hat im 7.GM keinen "Clear Fog of War" um sich herum. Er kann also im "schwarzen" Bereich der Karte "verschwinden". (Wenn man die gesamte Gruppe anklickt und zu einer Stelle laufen l&auml;sst, wird er es ebenfalls versuchen, sofern er nicht irgendwo feststeckt o.&auml;. Dann hilft nur noch der Teleportationscheat "Strg+j" um die Gruppe wieder zu versammeln. Mir ist das so noch nicht geschehen, es ist aber theoretisch m&ouml;glich, wenn der NPC z.B. einen Feind verfolgt.)<br />
-Items im Inventar werden *nicht* als Items im Besitz der Gruppe erkannt. Dies ist ein Engineproblem. Daraus folgt, dass Questitems die im Spiel ben&ouml;tigt werden, nicht im Inventar des NPCs sein sollten, wenn sie vom Questgeber erkannt werden sollen. Beispiele: Elvenhaars Buch, Ankhegpanzer f&uuml;r Taerom etc.<br />
-Als "critical" getaggte Quest-Items werden beim Wechsel in den 7. GMM in das Inventar des HC verschoben. Dadurch landen eventuell Gegenst&auml;nde aus dem Inventar des HC auf dem Boden. Dies ist ein Engineproblem. Daraus ergibt sich, dass Ihr immer nach Wechsel des NPC in de 7.GMM nachschauen solltet, ob Items auf dem Boden gelandet sind!<br />
-Wenn bei einem meiner Quests speziell f&uuml;r diesen NPC neue Items &uuml;bergeben werden, erscheinen diese immer im Inventar der Gruppe bzw. HC, auch wenn sie eigentlich der NPC erhalten soll. Dies ist ein Engineproblem. Auch wenn ich es so gescriptet haben sollte, dass die Gegenst&auml;nde schlussendlich im Inventar des NPCs sind, werden sie trotzdem &uuml;ber das Inventar des HC geh&auml;ndelt. Wie sonst auch im Spiel k&ouml;nnen auch hierbei Gegenst&auml;nde aus dem Inventar auf dem Boden gelandet sein.<br />
-F&uuml;r meine NPCs habe ich versucht, bei den eigenen Questitems (auch wenn es sich um Originalitems des Spiels handelt, sofern sie f&uuml;r den Quest meines NPCs n&ouml;tig sind) diese auch im Inventar des NPC erkennen zu lassen. Das klappt mit folgenden Einschr&auml;nkungen:<br />
-- Alle Items, um die es geht, werden &uuml;ber das Inventar das HC geh&auml;ndelt bevor sie entweder einem Questgeber gegeben oder von diesem erhalten wurden. Das bedeutet, dass andere Items auf dem Boden gelandet sein k&ouml;nnten.<br />
-- Befand sich das weggebene Item in einem Nimmervollen Beutel (dazu z&auml;hle ich auch Edelsteinbeutel, Taschen f&uuml;r Flaschen etcpp.), dann wird das Item nicht entfernt. Es ist danach noch immer im Nimmervollen Beutel und kann Probleme bereiten, wenn der Quest nicht stabil gescriptet wurde (und davon ausgeht, dass das Item weg sein sollte).<br />
-- 2. Problem mit Items im Nimmevollen Beutel: Befand sich das weggebene Item in einem Nimmervollen Beutel, dann st&uuml;rt aus unerfindlichen Gr&uuml;nden das Spiel ab, wenn der NPC danach wieder &uuml;ber die PID-Option als vollwertiges Mitglied in die Gruppe aufgenommen werden soll. Dieser "Absturzbug" l&auml;sst sich umgehen, indem das Spiel gespeichert und wieder geladen wird.<br />
<br />

HINWEISE F&Uuml;R MODDER / DAS SKRIPTEN DES 7.GMM:</br>
-Damit der NPC im 7. GM nicht stirbt aber auch nicht als unsterblicher Tank zur Verf&uuml;gung steht verwende ich eine Kombination an Effekten und Skriptbefehlen falls die HP zu niedrig werden. Fragen dazu beantworte ich gerne.</br>
-Wenn der NPC niedrige Lebenspunkte hat kann er sterben, wenn er wieder in die Gruppe aufgenommen wird. Ich verhindere das, indem er nach jedem Kampf wieder voll geheilt wird.</br>
-Das enginebedingte Aufrufen der Banter im B.dlg beinhaltet keine Familiars, d.h. die Banter (bzw. Inhalte des B.dlg) m&uuml;ssen &uuml;ber Skript des NPCs "per Hand" getriggert werden.</br>
-Die Rastdialog d.bcs wird ebenfalls nicht aufgerufen. Rastdialoge m&uuml;ssen zus&auml;tzlich in die des Player1d.bcs eingef&uuml;gt werden, damit sie getriggert werden k&ouml;nnen, wenn der NPC im 7. GMM ist.</br>
-Das H&auml;ndeln der Dialoge muss von Hand erfolgen, also beim Verlassen der Gruppe zum Wechsel in den 7. GMM muss der Dialog des NPC auf den Joined J.dlg gesetzt werden, damit er an Dialogen etc. teilnehmen kann.</br>
-Eine einfache Abfrage ob der NPC in der Gruppe ist (InParty("npcname")) reicht nicht aus, weil diese Abfrage f&uuml;r Familiars nicht g&uuml;ltig ist. Das gilt auch for das in der EE verl&auml;sslich funktionierende IfValidForPartyDialog().</br>
-GiveItemCreate erzeugt das Item im Inventar des Player1 und des 7.GM, wenn der 7.GM als Empf&auml;nger angegeben wurde. Neue Items m&uuml;ssen also immer direkt (und nur) ins Inventar des Player1 gegeben werden.</br>
-GiveItem vom 7. GM zu einem Questcharakter wird nicht ausgef&uuml;hrt. Der 7.GM muss also Items erst per Skriptbefehl ins Inventar des Player1 geben, von dort aus k&ouml;nnen Questcharaktere sie nehmen.</br>
-Das Handling von Items &uuml;ber das Inventar des Player1 ist insofern auch vorteilhaft, als dass man nur aus dem Inventar der Gruppenmitglieder eine bestimmte Anzahl entfernen kann (TakePartyItemNum). Der 7.GM kann nur den ganzen Stack weiterreichen.</br>
</div>

<h1><a name="issues" id="issues">Bekannte Probleme</a></h1>
<div class="section">
Nochmal in K&uuml;rze die wichtigsten Tips beim Spielen im 7. GMM zusammengefast:<br />
-In manchen Cutscenes und Traumsequenzen wird Brandock als 7. Gruppenmitglied ebenfalls dabei sein. Ich habe vor, das in einer späteren Version für die mir bekannten Cutscenes zu beheben.</br>
-Brandock hat keinen sogenannten "Clear Fog of War"-Effekt, wenn er als 7. Gruppenmitglied mitl&auml;uft. Das hei&szlig;t, dass das Gebiet, in dem er sich befindet, nicht gesehen werden kann und Brandock so im dunklen Bereich "verloren gehen" kann. Durch ein Zusammenrufen der Gruppe sollte er wieder im sichtbaren Bereich auftauchen, falls dies geschieht. (Der Grund hierf&uuml;r ist, dass die Engine nicht mehr als 8 Kreaturen pro Gebiet mit dieser Eigenschaft h&auml;ndeln kann - darin inbegriffen sind die 6 Gruppenmitglieder und eventuelle Cutscene-Spione!)</br>
-Nach jedem Questereignis und nach dem Wechsel in den 7.GMM nochmal schauen, ob der HC Items aus dem Inventar verloren hat, die wieder vom Boden aufgelesen werden sollten.<br />
-Es ist n&ouml;tig und auch zu empfehlen, nicht-kritische Questitems nicht im Inventar der 7. GM sondern in dem der normalen Gruppenmitglieder zu haben.<br />
-Gegenstände im Inventar des 7. GM werden nicht erkannt, das heißt Questgeber reagieren, als hätte die Gruppe den Gegenstand nicht dabei. Für meine eigenen NPCs habe ich die modeigenen Questgegenstände zwar größtenteils über Skript auch in diesem Fall im Inventar des NPC erkennen lassen, aber auch das funktioniert nicht problemlos.</br>
-Questitems aus Beuteln/Nimmervollen Taschen im Inventar des 7. GM nehmen, bevor man die entsprechenden Questgeber anspricht, um den "Absturzbug" zu verindern.<br />
-Speichern, bevor ein 7. GM wieder in die Gruppe aufgenommen werden soll. Sollte das Spiel dann abst&uuml;rzen, den Spielstand neu laden. Damit sollte der Absturz nicht auftreten.<br />
</br>
</div>

<h1><a name="acknow" id="acknow">Danksagungen</a></h1>
<div class="section">
<strong>Acifer:</strong> Portraits, Ideen, D&D-Wissen, Alphatests. Danke, dass Du Brandock ein Gesicht gegeben hast (sogar mehrere) mit den tollen Portraits!</br>
<strong>berelinde:</strong> Ideen.</br>
<strong>Brokenkatana:</strong> Korrekturlesen (Englisch).</br>
<strong>Caedwyr:</strong> Korrekturlesen und Formulierungshilfen (English).</br>
<strong>Gerri:</strong> Deutsche Version der Valeriecrossmod.</br>
<strong>Lava:</strong> Area artist (Thalantyr's private quarters).</br>
<strong>Lumorus:</strong> Testen.</br>
<strong>maus:</strong> Testen.</br>
<strong>Morywen:</strong> Ideen, Testen.</br>
<strong>Reader of the Runes:</strong> Deutsches Soundset. Danke, dass Du Brandock eine Stimme gegeben hast!</br> 
</br>
Danke an BioWare, Black Isle und Wizards of the Coast f&uuml;r Baldur's Gate 1, 2 und die Infinity Engine, und BeamDog f&uuml;r das Neuauflegen der Spiele.</br>
Danke ans Kerzenburgforum f&uuml;r das Hosten der Mod und das Bereitstellen von Austauschm&ouml;glichkeiten mit anderen Moddern und Spielern.</br>
Danke an alle Modder die f&uuml;r die IE-Engine Modding Tools entwickelt haben oder gerade pflegen. Ohne w&auml;re diese Modifikation nicht m&ouml;glich gewesen.</br>
Danke an alle, die diese oder meine anderen Modifikationen spielen, und f&uuml;r Euer Feedback welches es mir erm&ouml;glicht, sie zu verbessern. Ohne Euch w&uuml;rd's nicht viel Spa&szlig; machen!</br>
Das meine ich ernst, auch wenn ich diesen Textbaustein in anderen Readmes ebenfalls verwende! :-)</br>
</div>

<h1><a name="tools" id="tools">Verwendete Tools</a></h1>
<div class="section">
      <ul> 
		<li><a href="https://gibberlings3.github.io/iesdp/index.htm">IESDP</a></li>
		<li><a href="https://forums.beamdog.com/discussion/30593/new-versions-of-nearinfinity-available/p1">Near Infinity</a></li>
		<li><a href="https://github.com/WeiDUorg/weidu/releases/latest">WeiDU</a></li>
		<li><a href="http://tools.stefankueng.com/grepWin.html">grepWin</a></li>
		<li><a href="http://winmerge.org/">WinMerge</a></li>
      </ul>
<h2> <a name="communities" id="communities">Modding Communitys, Tutorials und technische Unterst&uuml;tzung</a></h2>
      <ul> 
		<li><a href="https://www.baldurs-gate.de/index.php">Kerzenburgforum (German)</a></li>
		<li><a href="https://www.gibberlings3.net/">The Gibberlings Threey</a></li>
		<li><a href="http://pocketplane.net">Pocket Plane Group</a></li>
		<li><a href="http://www.shsforums.net/">Spellhold Studios</a></li>
      </ul>
<h2> <a name="links" id="links">Weitere Links</a></h2>
      <ul> 
		<li><a href="https://forums.beamdog.com/discussion/71305/mod-dlc-merger-merge-steam-gog-sod-dlc-or-custom-dlcs-with-the-main-game">DLC Merger</a></li>
		<li><a href="https://forums.beamdog.com/discussion/50441/modmerge-merge-your-steam-gog-zip-based-dlc-into-something-weidu-nearinfinity-dltcep-can-use/p1)">Modmerger (deprecated but still functional tool for mod merging)</a></li>
      </ul>
</div>


<h1><a name="credit" id="credit">Copyright</a></h1>
<div class="section">
This mod is unofficial Fan Content permitted under the Fan Content Policy. Not approved/endorsed by Wizards. Portions of the materials used are property of Wizards of the Coast. ©Wizards of the Coast LLC.
This mod is also not developed, supported, or endorsed by BioWare, Black Isle Studios, Interplay Entertainment Corp., Overhaul Games or Beamdog. All other trademarks and copyrights are property of their respective owners.
</div> 

<h1><a name="version" id="version">Versionshistorie</a></h1>
<div class="section">
Version Beta 13:</br>
- More interjections in Korlasz Tomb.</br>
- Minor internal restructuring with regard to how Korlasz Tomb is handled.</br>
- Improved compatibility and crossmod with EndlessBG1 and Transitions mod.</br>
</br>
Version Beta 12:</br>
- Brandock will say a goodbye line upon original transition to SoD (interjection into Imoens dialogue)).</br>
- Added crossmod with EndlessBG1 (Brandock will say a goodbye line upon leaving).</br>
- Fixed crossmod with Transitions (update to Transitions v1.1 plus fix: Brandock will not say the BGII goodbye line upon SoD transition).</br>
- Updated crossmod with Framed: Brandock will now also talk about going to Candlekeep if he saw the monastery before receiving the work order.</br>
- Added short "space timer" so Brandock doesn't fire several dialogues in a row in case he joins the group late(r).</br>
- Changed Brandock's level-up system: He will only level up to the PC's level if: he joins the first time for BG1/SoD/BGII OR he joins after being a 7th party member. No more automatic level-up although he is in party or was separated for a while.</br>
</br>
Version Beta 11:</br>
- German version (BG1) completed.</br>
- BG1 content completed. Only thing missing is more crossmod.</br>
- Crossmod is now separate component.</br>
- "Brandock scribes his first scroll" quest fixed.</br>
- "Brandock Restores his Book" quest revised.</br>
- Added more instances to "Lore Path".</br>
- Fixed BG1 "go to Beregost" kickout option.</br>
- Fixed comment on flooded mines: should not be doubled if Breagar is in party.</br>
- Corrected "BrandockSpawn" variable in SoD.</br>
- Typo corrections.</br>
- Brandock should only comment on Jardak and/or Drelik's deaths if they indeed died.</br>
- Brandock should only comment on Delorna + Ithmeera + Helshara being dead if they indeed died.</br>
- Dialogue about schlumsha the sewer slime king should trigger correctly.</br>
- Added one more line to Brandock's dialogue after shape shifting in Candlekeep.</br>
- Brandock's book case should not vanish in Irenicus' Dungeon.</br>
- Cutscene at Thalantyr's shortened.</br>
- The area for Cutscene at Thalantyr's should be empty afterwards.</br>
- Brandock should not read Sunin's spell book twice / find a spell book with Joular.</br>
- Crossmod interjection to bg1ub's "Mysterious vial" quest should be at the right state of Thalantyr's dialogue.</br>
- Crossmod with BG1NPC (Imoen's tome) should not stutter.</br>
- Crossmod with BST: finding spellbook of dead mage should lead to lore increase.</br>
- Crossmod with Breagar should not skip 1,5 banter.</br>
- Reworked Brandock's reaction to Cadlekeep to make it better compatible with Framed Mod.</br>
- Added some Crossmod with Framed Mod.</br>
- Brandock's book case now takes Miscellaneous items, too, to allow for quest books.</br>
- Wrong "Slow Poison" spell removed from Brandock's spell book for new SoD or BGII game.</br>
- Added missing InParty checks to trigger script blocks.</br>
- Updated credits section.</br>
- Changed instances of "OSX" to "macOS".</br>
- Added globally unique LABELs to support Project Infinity.</br>
- Added more notes about playing in 7th party member mode to readme.</br>
</br>
Version Beta 10:</br>
- Fixed stutter for book restore quest.</br>
- Edited c#brandock.ini to shorten mod package name.</br>
- Corrected "ring" to "spellbook" in SoA meting dialogue.</br>
- Thalantyr should say his line in crossmod with A. Questpack "Of Wolves and Men".</br>
- Added !See([ENEMY]) to lorepath script blocks.</br>
</br>
Version Beta 9:</br>
- Fixed stutter for journal entry after first lore increase.</br>
</br>
Version Beta 8:</br>
- Fixed crossmod install errors for BG1NPC and ntotsc crossmod..</br>
</br>
Version Beta 7:</br>
- Dialogue about being infected with lycantrophy should not stutter.</br>
- Dialogue about inside Durlag's Tower should not loop.</br>
- 3 more banters with Xan added (BG1).<br />
- more interjections added (BG1).<br />
- Imoen's DV should be applied correctly in BG1NPC crossmod script.</br>
- More Imoen BG1NPC crossmod.</br>
- 7th party member mode should be removed correctly if Brandock changes from it to full member (or is kicked out instead).</br>
- SoD: interjection into Ammon's dialogue should be to the right state.</br>
- SoD: Brandock should not die instead of Ophyllis.</br>
- SoD: added more randomness to when Brandock is chosen in Thrix' game.</br>
- uses same area for Thalantyr's private quarters like bg1re and SotSC, from Lava.<br />
- crossmod added: more crossmod banters with Brage NPC; more banter with Breagar; bg1re (Necromancer's Trouble, Dinner with Thalantyr); Ascalon's Questpack (The Great Karlini, From Wolves and Men); Balduran's Seatower; Solaufein's Rescue; Imoen4Ever; Lure Of Sirine's Call; Shades of the Sword Coast; SoA; Transitions).<br />
- Structure of folders changed: mod uses "autotra" folder for text conversion so the original files stay unchanged.<br />
- Quests finished: "lorepath", "half-ogre shapeshifting" (BG1+SoD), "scroll scribing".<br />
- SoD: new optional component changes SoD banter to "Dialogue style".<br />
- BGII: changed Ebrel's ring to his spell book. Added possibility to arrange for his funeral in the Temple of Helm.<br />
<br />
Version Beta 6:</br>
- journal entry for Brandock's restore book path should work as intended.</br>
- book restore path: Brandock should not think that all ingredients are present if they are not.</br>
- mapnote to Elvenhair only for BGT (EE adds an own one)</br>
- dialog after death of Mutamin should not lead to stutter</br>
- Brandock should not start banter before switching into 7th party member mode is done.</br>
- Brandock should not start dialogue about Brage if Brandock-Brage banter happened.</br>
- Thalantyr should start dialogue to help Brandock after Melicamp is restored.</br>
- fix stutter bug in BGII</br>
- proof readings by Caedwyr integrated.</br>
- Slow Poison corrected to necromancy spell instead of innate.</br>
- Thalantyr should start spell to help Brandock after the half-ogre incident also if Brandock was 7th party member when it happened.</br>
<br />
Version Beta 5:</br>
- BG1NPC crossmod (IMoen's tome) should install correctly.</br>
<br />
Version Beta 4:</br>
- (German version) Note about Brandock's Lore increase should not be in English.</br>
- (English version) Integrated proof readings by Brokenkatana.</br>
- Crossmod with Valerie mod added. Not approved yet by Tempest. Will be changed or removed if requested.</br>
- (Crossmod compatibility) Brandock should not complain that no one cares about the attack in Beregost inn if Moidre from Glam's pack is near.</br>
- crossmod with bg1npc (Imoen's tome) should be installed.</br>
- Brandock should not refer to Bentha being killed if she survived (Nashkel Carnival).</br>
- Revised Brandock's reactions if his book is not in inventory.</br>
- Brandock's book(s) and bookcase are no longer tagged as critical items (Brandock's books should not always land in HC's inventory if Brandock changes into 7th member mode).</br>
- C#5MINHP.spl should not be applied to party.</br>
- Change into 7th party member mode and back should not be interrupted.</br>
- Brandock's lore should be increased after reading spell components to create a Halruaan skyship.</br>
- Brandock's lore should only increase once after the Niemain encounter.</br>
- More interjections and lore increases added.</br>
- Dialoge after Sarevok's death added (for BGT or if game remains in BG1 due to other mod).</br>
- More crossmod added: Gavin BG1, Breagar BG1</br>
<br />
Version Beta 3:</br>
- Thalantyr should not try to initiate Brandock's Quest after Melicamp is rescued if Brandock-Melicamp interaction did not happen beforehand.</br>
<br />
Version Beta 2:</br>
-install will not fail if Alternatives in installed</br>
-Brandock will not comment on Tranzig before he was met in Chapter 3</br>
</br>
Version Beta 1:</br>
- Erste Ver&ouml;ffentlichung mit BG1-Inhalten.</br>
<br />
</div>

</body>